In [1]:
from pyspark.sql import SparkSession
from pyspark.sql.types import *
from pyspark.sql.functions import *
import pandas as pd
#col, from_utc_timestamp,upper,lower,initcap,concat_ws,regexp_replace,isnan,when,count,coalesce

In [2]:
spark=SparkSession.builder.master('local[1]').appName('Credit Card Management System').getOrCreate()

### DATA WRANGLING

Cleaning file 'cdw_sapp_custmer.json'

In [3]:
df_cust=spark.read.json('cdw_sapp_custmer.json')
df_cust.show(4)

+------+----------------+------------+-------------+-------------------+----------+----------+--------+----------+---------+--------------------+-----------+---------+-----------------+
|APT_NO|  CREDIT_CARD_NO|   CUST_CITY| CUST_COUNTRY|         CUST_EMAIL|CUST_PHONE|CUST_STATE|CUST_ZIP|FIRST_NAME|LAST_NAME|        LAST_UPDATED|MIDDLE_NAME|      SSN|      STREET_NAME|
+------+----------------+------------+-------------+-------------------+----------+----------+--------+----------+---------+--------------------+-----------+---------+-----------------+
|   656|4210653310061055|     Natchez|United States|AHooper@example.com|   1237818|        MS|   39120|      Alec|   Hooper|2018-04-21T12:49:...|         Wm|123456100|Main Street North|
|   829|4210653310102868|Wethersfield|United States|EHolman@example.com|   1238933|        CT|   06109|      Etta|   Holman|2018-04-21T12:49:...|    Brendan|123453023|    Redwood Drive|
|   683|4210653310116272|     Huntley|United States|WDunham@example.com|   1243018|        IL|   60142|    Wilber|   Dunham|2018-04-21T12:49:...|   Ezequiel|123454487| 12th Street East|
|   253|4210653310195948|   NewBerlin|United States| EHardy@example.com|   1243215|        WI|   53151|   Eugenio|    Hardy|2018-04-21T12:49:...|      Trina|123459758|Country Club Road|
+------+----------------+------------+-------------+-------------------+----------+----------+--------+----------+---------+--------------------+-----------+---------+-----------------+
only showing top 4 rows

In [4]:
#checking for duplicates
df_cust.groupBy(df_cust.columns).count().where('count>1').show()
(df_cust.distinct().count())==(df_cust.count())

+------+--------------+---------+------------+----------+----------+----------+--------+----------+---------+------------+-----------+---+-----------+-----+
|APT_NO|CREDIT_CARD_NO|CUST_CITY|CUST_COUNTRY|CUST_EMAIL|CUST_PHONE|CUST_STATE|CUST_ZIP|FIRST_NAME|LAST_NAME|LAST_UPDATED|MIDDLE_NAME|SSN|STREET_NAME|count|
+------+--------------+---------+------------+----------+----------+----------+--------+----------+---------+------------+-----------+---+-----------+-----+
+------+--------------+---------+------------+----------+----------+----------+--------+----------+---------+------------+-----------+---+-----------+-----+

True

In [5]:
def check_nulls(df):
    navalues=df.select([
    (
        count(when((isnan(c) | col(c).isNull()), c)) if t not in ("timestamp", "date")
        else count(when(col(c).isNull(), c))
    ).alias(c)
    for c, t in df.dtypes if c in df.columns])
    return navalues

check_nulls(df_cust).show()

+------+--------------+---------+------------+----------+----------+----------+--------+----------+---------+------------+-----------+---+-----------+
|APT_NO|CREDIT_CARD_NO|CUST_CITY|CUST_COUNTRY|CUST_EMAIL|CUST_PHONE|CUST_STATE|CUST_ZIP|FIRST_NAME|LAST_NAME|LAST_UPDATED|MIDDLE_NAME|SSN|STREET_NAME|
+------+--------------+---------+------------+----------+----------+----------+--------+----------+---------+------------+-----------+---+-----------+
|     0|             0|        0|           0|         0|         0|         0|       0|         0|        0|           0|          0|  0|          0|
+------+--------------+---------+------------+----------+----------+----------+--------+----------+---------+------------+-----------+---+-----------+

In [6]:
df_cust=df_cust.withColumn('SSN',col('SSN').cast('int'))
df_cust=df_cust.withColumn('CUST_ZIP',col('CUST_ZIP').cast('int'))
df_cust=df_cust.withColumn('LAST_UPDATED',from_utc_timestamp('LAST_UPDATED','UTC'))
df_cust=df_cust.withColumn('FIRST_NAME',initcap(col('FIRST_NAME')))
df_cust=df_cust.withColumn('MIDDLE_NAME',lower('MIDDLE_NAME'))
df_cust=df_cust.withColumn('LAST_NAME',initcap(col('LAST_NAME')))
df_cust=df_cust.withColumn('FULL_STREET_ADDRESS',concat_ws(',',df_cust.STREET_NAME,df_cust.APT_NO))
df_cust=df_cust.withColumn('CUST_PHONE',regexp_replace(col('CUST_PHONE'),'^(\d{1})(\d{3})(\d{3})$','(+$1)$2-$3'))

df_cust.printSchema()

root
 |-- APT_NO: string (nullable = true)
 |-- CREDIT_CARD_NO: string (nullable = true)
 |-- CUST_CITY: string (nullable = true)
 |-- CUST_COUNTRY: string (nullable = true)
 |-- CUST_EMAIL: string (nullable = true)
 |-- CUST_PHONE: string (nullable = true)
 |-- CUST_STATE: string (nullable = true)
 |-- CUST_ZIP: integer (nullable = true)
 |-- FIRST_NAME: string (nullable = true)
 |-- LAST_NAME: string (nullable = true)
 |-- LAST_UPDATED: timestamp (nullable = true)
 |-- MIDDLE_NAME: string (nullable = true)
 |-- SSN: integer (nullable = true)
 |-- STREET_NAME: string (nullable = true)
 |-- FULL_STREET_ADDRESS: string (nullable = false)

In [7]:
df_cust=df_cust.drop(*['APT_NO','STREET_NAME'])

In [8]:
df_cust.columns

['CREDIT_CARD_NO',
 'CUST_CITY',
 'CUST_COUNTRY',
 'CUST_EMAIL',
 'CUST_PHONE',
 'CUST_STATE',
 'CUST_ZIP',
 'FIRST_NAME',
 'LAST_NAME',
 'LAST_UPDATED',
 'MIDDLE_NAME',
 'SSN',
 'FULL_STREET_ADDRESS']

In [9]:
col_order=['SSN','FIRST_NAME','MIDDLE_NAME','LAST_NAME','FULL_STREET_ADDRESS','CUST_CITY','CUST_STATE',
 'CUST_COUNTRY','CUST_ZIP','CUST_PHONE','CUST_EMAIL','LAST_UPDATED']
df_cust=df_cust.select(*col_order)

In [10]:
df_cust.show(truncate=False)

+---------+----------+-----------+---------+---------------------+------------+----------+-------------+--------+-----------+----------------------+-------------------+
|SSN      |FIRST_NAME|MIDDLE_NAME|LAST_NAME|FULL_STREET_ADDRESS  |CUST_CITY   |CUST_STATE|CUST_COUNTRY |CUST_ZIP|CUST_PHONE |CUST_EMAIL            |LAST_UPDATED       |
+---------+----------+-----------+---------+---------------------+------------+----------+-------------+--------+-----------+----------------------+-------------------+
|123456100|Alec      |wm         |Hooper   |Main Street North,656|Natchez     |MS        |United States|39120   |(+1)237-818|AHooper@example.com   |2018-04-21 12:49:02|
|123453023|Etta      |brendan    |Holman   |Redwood Drive,829    |Wethersfield|CT        |United States|6109    |(+1)238-933|EHolman@example.com   |2018-04-21 12:49:02|
|123454487|Wilber    |ezequiel   |Dunham   |12th Street East,683 |Huntley     |IL        |United States|60142   |(+1)243-018|WDunham@example.com   |2018-04-21 12:49:02|
|123459758|Eugenio   |trina      |Hardy    |Country Club Road,253|NewBerlin   |WI        |United States|53151   |(+1)243-215|EHardy@example.com    |2018-04-21 12:49:02|
|123454431|Wilfred   |may        |Ayers    |Madison Street,301   |ElPaso      |TX        |United States|79930   |(+1)242-074|WAyers@example.com    |2018-04-21 12:49:02|
|123454202|Beau      |ambrose    |Woodard  |Colonial Drive,3     |NorthOlmsted|OH        |United States|44070   |(+1)242-570|BWoodard@example.com  |2018-04-21 12:49:02|
|123451799|Sheila    |larry      |Kemp     |Belmont Avenue,84    |Vienna      |VA        |United States|22180   |(+1)239-685|SKemp@example.com     |2018-04-21 12:49:02|
|123453875|Wendy     |ora        |Hurley   |Oxford Court,728     |Duarte      |CA        |United States|91010   |(+1)238-213|WHurley@example.com   |2018-04-21 12:49:02|
|123457511|Alec      |tracie     |Gilmore  |Forest Street,81     |Owosso      |MI        |United States|48867   |(+1)240-689|AGilmore@example.com  |2018-04-21 12:49:02|
|123457464|Barbra    |mitchel    |Lau      |Court Street,561     |Zion        |IL        |United States|60099   |(+1)235-222|BLau@example.com      |2018-04-21 12:49:02|
|123457639|Edmundo   |denny      |Thomson  |Cypress Court,622    |Youngstown  |OH        |United States|44512   |(+1)241-363|EThomson@example.com  |2018-04-21 12:49:02|
|123453242|Elsa      |isabelle   |Truong   |8th Street West,924  |Summerville |SC        |United States|29483   |(+1)236-228|ETruong@example.com   |2018-04-21 12:49:02|
|123454339|Homer     |henry      |Mckinney |East Avenue,611      |ElPaso      |TX        |United States|79930   |(+1)238-165|HMckinney@example.com |2018-04-21 12:49:02|
|123454537|Rita      |rickey     |Kidd     |Route 44,680         |Fenton      |MI        |United States|48430   |(+1)234-730|RKidd@example.com     |2018-04-21 12:49:02|
|123452373|Amalia    |heriberto  |Ballard  |Warren Street,71     |Grandville  |MI        |United States|49418   |(+1)242-113|ABallard@example.com  |2018-04-21 12:49:02|
|123455343|Patty     |angelita   |Thomas   |Jones Street,195     |YubaCity    |CA        |United States|95993   |(+1)239-888|PThomas@example.com   |2018-04-21 12:49:02|
|123451533|Josefina  |dorothea   |Morrow   |New Street,500       |CapeCoral   |FL        |United States|33904   |(+1)240-158|JMorrow@example.com   |2018-04-21 12:49:02|
|123459278|Nelson    |jefferson  |Andrews  |Division Street,989  |Brookfield  |WI        |United States|53045   |(+1)241-408|NAndrews@example.com  |2018-04-21 12:49:02|
|123456915|Miquel    |maximo     |Schneider|Maple Street,810     |Richmond    |VA        |United States|23223   |(+1)238-390|MSchneider@example.com|2018-04-21 12:49:02|
|123453807|Parker    |arnulfo    |Tidwell  |Eagle Road,649       |WestChester |PA        |United States|19380   |(+1)235-067|PTidwell@example.com  |2018-04-21 12:49:02|
+---------+----------+-----------+---------+---------------------+------------+----------+-------------+--------+-----------+----------------------+-------------------+
only showing top 20 rows

In [11]:
#pip install mysql-connector-python

In [12]:
from mysql.connector import Error
#Write to MySQL Table
def write_to_db(df,table_name):
    try:
        df.write.format("jdbc")\
        .option("driver","com.mysql.cj.jdbc.Driver")\
        .option("url", "jdbc:mysql://localhost:3306/creditcard_capstone")\
        .option("dbtable", table_name)\
        .option("user", "root")\
        .option("password", "admin")\
        .save()
        print(f'{table_name} table is created')
    except Exception as e:
        print('Error while connecting to MySQL',e)
write_to_db(df_cust,'CDW_SAPP_CUSTOMER')

Error while connecting to MySQL Table or view 'CDW_SAPP_CUSTOMER' already exists. SaveMode: ErrorIfExists.

Cleaning file 'cdw_sapp_branch.json'

In [13]:
df_branch=spark.read.json('cdw_sapp_branch.json')
check_nulls(df_branch).show()

+-----------+-----------+-----------+------------+------------+-------------+----------+------------+
|BRANCH_CITY|BRANCH_CODE|BRANCH_NAME|BRANCH_PHONE|BRANCH_STATE|BRANCH_STREET|BRANCH_ZIP|LAST_UPDATED|
+-----------+-----------+-----------+------------+------------+-------------+----------+------------+
|          0|          0|          0|           0|           0|            0|         0|           0|
+-----------+-----------+-----------+------------+------------+-------------+----------+------------+

In [14]:
#checking for duplicates
df_branch.groupBy(df_branch.columns).count().where('count>1').show()
(df_branch.distinct().count())==(df_branch.count())

+-----------+-----------+-----------+------------+------------+-------------+----------+------------+-----+
|BRANCH_CITY|BRANCH_CODE|BRANCH_NAME|BRANCH_PHONE|BRANCH_STATE|BRANCH_STREET|BRANCH_ZIP|LAST_UPDATED|count|
+-----------+-----------+-----------+------------+------------+-------------+----------+------------+-----+
+-----------+-----------+-----------+------------+------------+-------------+----------+------------+-----+

True

In [15]:
df_branch.show(3)

+-----------------+-----------+------------+------------+------------+-----------------+----------+--------------------+
|      BRANCH_CITY|BRANCH_CODE| BRANCH_NAME|BRANCH_PHONE|BRANCH_STATE|    BRANCH_STREET|BRANCH_ZIP|        LAST_UPDATED|
+-----------------+-----------+------------+------------+------------+-----------------+----------+--------------------+
|        Lakeville|          1|Example Bank|  1234565276|          MN|     Bridle Court|     55044|2018-04-18T16:51:...|
|          Huntley|          2|Example Bank|  1234618993|          IL|Washington Street|     60142|2018-04-18T16:51:...|
|SouthRichmondHill|          3|Example Bank|  1234985926|          NY|    Warren Street|     11419|2018-04-18T16:51:...|
+-----------------+-----------+------------+------------+------------+-----------------+----------+--------------------+
only showing top 3 rows

In [16]:
df_branch.printSchema()

root
 |-- BRANCH_CITY: string (nullable = true)
 |-- BRANCH_CODE: long (nullable = true)
 |-- BRANCH_NAME: string (nullable = true)
 |-- BRANCH_PHONE: string (nullable = true)
 |-- BRANCH_STATE: string (nullable = true)
 |-- BRANCH_STREET: string (nullable = true)
 |-- BRANCH_ZIP: long (nullable = true)
 |-- LAST_UPDATED: string (nullable = true)

In [17]:
cols=['BRANCH_CODE','BRANCH_ZIP']
for col_name in cols:
    df_branch=df_branch.withColumn(col_name,col(col_name).cast('int'))
df_branch=df_branch.withColumn('BRANCH_PHONE',regexp_replace(col('BRANCH_PHONE'),'^(\d{3})(\d{3})(\d{4})$','($1)$2-$3'))
df_branch=df_branch.withColumn('LAST_UPDATED',from_utc_timestamp('LAST_UPDATED','UTC'))

In [18]:
df_branch.show(3)

+-----------------+-----------+------------+-------------+------------+-----------------+----------+-------------------+
|      BRANCH_CITY|BRANCH_CODE| BRANCH_NAME| BRANCH_PHONE|BRANCH_STATE|    BRANCH_STREET|BRANCH_ZIP|       LAST_UPDATED|
+-----------------+-----------+------------+-------------+------------+-----------------+----------+-------------------+
|        Lakeville|          1|Example Bank|(123)456-5276|          MN|     Bridle Court|     55044|2018-04-18 16:51:47|
|          Huntley|          2|Example Bank|(123)461-8993|          IL|Washington Street|     60142|2018-04-18 16:51:47|
|SouthRichmondHill|          3|Example Bank|(123)498-5926|          NY|    Warren Street|     11419|2018-04-18 16:51:47|
+-----------------+-----------+------------+-------------+------------+-----------------+----------+-------------------+
only showing top 3 rows

In [19]:
col_order=['BRANCH_CODE','BRANCH_NAME','BRANCH_STREET','BRANCH_CITY','BRANCH_STATE','BRANCH_ZIP','BRANCH_PHONE','LAST_UPDATED']
df_branch=df_branch.select(*col_order)
df_branch.show(3)

+-----------+------------+-----------------+-----------------+------------+----------+-------------+-------------------+
|BRANCH_CODE| BRANCH_NAME|    BRANCH_STREET|      BRANCH_CITY|BRANCH_STATE|BRANCH_ZIP| BRANCH_PHONE|       LAST_UPDATED|
+-----------+------------+-----------------+-----------------+------------+----------+-------------+-------------------+
|          1|Example Bank|     Bridle Court|        Lakeville|          MN|     55044|(123)456-5276|2018-04-18 16:51:47|
|          2|Example Bank|Washington Street|          Huntley|          IL|     60142|(123)461-8993|2018-04-18 16:51:47|
|          3|Example Bank|    Warren Street|SouthRichmondHill|          NY|     11419|(123)498-5926|2018-04-18 16:51:47|
+-----------+------------+-----------------+-----------------+------------+----------+-------------+-------------------+
only showing top 3 rows

In [20]:
write_to_db(df_branch,'CDW_SAPP_BRANCH')

Error while connecting to MySQL Table or view 'CDW_SAPP_BRANCH' already exists. SaveMode: ErrorIfExists.

Cleaning file 'cdw_sapp_credit.json'

In [21]:
df_credit=spark.read.json('cdw_sapp_credit.json')
check_nulls(df_credit).show()

+-----------+--------------+--------+---+-----+--------------+----------------+-----------------+----+
|BRANCH_CODE|CREDIT_CARD_NO|CUST_SSN|DAY|MONTH|TRANSACTION_ID|TRANSACTION_TYPE|TRANSACTION_VALUE|YEAR|
+-----------+--------------+--------+---+-----+--------------+----------------+-----------------+----+
|          0|             0|       0|  0|    0|             0|               0|                0|   0|
+-----------+--------------+--------+---+-----+--------------+----------------+-----------------+----+

In [22]:
df_credit.show(3)

+-----------+----------------+---------+---+-----+--------------+----------------+-----------------+----+
|BRANCH_CODE|  CREDIT_CARD_NO| CUST_SSN|DAY|MONTH|TRANSACTION_ID|TRANSACTION_TYPE|TRANSACTION_VALUE|YEAR|
+-----------+----------------+---------+---+-----+--------------+----------------+-----------------+----+
|        114|4210653349028689|123459988| 14|    2|             1|       Education|             78.9|2018|
|         35|4210653349028689|123459988| 20|    3|             2|   Entertainment|            14.24|2018|
|        160|4210653349028689|123459988|  8|    7|             3|         Grocery|             56.7|2018|
+-----------+----------------+---------+---+-----+--------------+----------------+-----------------+----+
only showing top 3 rows

In [23]:
#checking for duplicates
print(df_credit.distinct().count()==df_credit.count())
df_credit.groupBy(df_credit.columns).count().where('count>1').show()

True
+-----------+--------------+--------+---+-----+--------------+----------------+-----------------+----+-----+
|BRANCH_CODE|CREDIT_CARD_NO|CUST_SSN|DAY|MONTH|TRANSACTION_ID|TRANSACTION_TYPE|TRANSACTION_VALUE|YEAR|count|
+-----------+--------------+--------+---+-----+--------------+----------------+-----------------+----+-----+
+-----------+--------------+--------+---+-----+--------------+----------------+-----------------+----+-----+

In [24]:
df_credit.printSchema()

root
 |-- BRANCH_CODE: long (nullable = true)
 |-- CREDIT_CARD_NO: string (nullable = true)
 |-- CUST_SSN: long (nullable = true)
 |-- DAY: long (nullable = true)
 |-- MONTH: long (nullable = true)
 |-- TRANSACTION_ID: long (nullable = true)
 |-- TRANSACTION_TYPE: string (nullable = true)
 |-- TRANSACTION_VALUE: double (nullable = true)
 |-- YEAR: long (nullable = true)

In [25]:
col_name=['CUST_SSN','BRANCH_CODE','TRANSACTION_ID']
for cols in col_name:
    df_credit=df_credit.withColumn(cols,col(cols).cast('int'))
df_credit = df_credit.withColumn("TIMEID", concat(df_credit["year"].cast("string"),
            lpad(df_credit["month"].cast("string"), 2, "0"),lpad(df_credit["day"].cast("string"), 2, "0")))
df_credit=df_credit.drop(*['DAY','MONTH','YEAR'])

In [26]:
col_order=['TRANSACTION_ID','TRANSACTION_TYPE','TRANSACTION_VALUE','CREDIT_CARD_NO','BRANCH_CODE','CUST_SSN','TIMEID']
df_credit=df_credit.select(*col_order)
df_credit.show()

+--------------+----------------+-----------------+----------------+-----------+---------+--------+
|TRANSACTION_ID|TRANSACTION_TYPE|TRANSACTION_VALUE|  CREDIT_CARD_NO|BRANCH_CODE| CUST_SSN|  TIMEID|
+--------------+----------------+-----------------+----------------+-----------+---------+--------+
|             1|       Education|             78.9|4210653349028689|        114|123459988|20180214|
|             2|   Entertainment|            14.24|4210653349028689|         35|123459988|20180320|
|             3|         Grocery|             56.7|4210653349028689|        160|123459988|20180708|
|             4|   Entertainment|            59.73|4210653349028689|        114|123459988|20180419|
|             5|             Gas|             3.59|4210653349028689|         93|123459988|20181010|
|             6|       Education|             6.89|4210653349028689|        164|123459988|20180528|
|             7|   Entertainment|            43.39|4210653349028689|        119|123459988|20180519|
|             8|             Gas|            95.39|4210653349028689|         23|123459988|20180808|
|             9|   Entertainment|            93.26|4210653349028689|        166|123459988|20180318|
|            10|           Bills|           100.38|4210653349028689|         83|123459988|20180903|
|            11|             Gas|            98.75|4210653349028689|         52|123459988|20180821|
|            12|             Gas|            42.71|4210653349028689|         17|123459988|20181224|
|            13|         Grocery|            40.24|4210653349028689|         80|123459988|20180403|
|            14|           Bills|            17.81|4210653349028689|         50|123459988|20180415|
|            15|           Bills|             29.0|4210653349028689|        123|123459988|20180517|
|            16|            Test|            70.63|4210653349028689|          9|123459988|20180706|
|            17|            Test|            27.04|4210653349028689|          3|123459988|20180928|
|            18|   Entertainment|            88.75|4210653349028689|        135|123459988|20180704|
|            19|            Test|            77.02|4210653349028689|        103|123459988|20180424|
|            20|           Bills|            34.34|4210653349028689|         78|123459988|20181008|
+--------------+----------------+-----------------+----------------+-----------+---------+--------+
only showing top 20 rows

In [27]:
write_to_db(df_credit,'CDW_SAPP_CREDIT_CARD')

Error while connecting to MySQL Table or view 'CDW_SAPP_CREDIT_CARD' already exists. SaveMode: ErrorIfExists.

https://raw.githubusercontent.com/platformps/LoanDataset/main/loan_data.json

In [28]:
import requests
url = 'https://raw.githubusercontent.com/platformps/LoanDataset/main/loan_data.json'
resp = requests.get(url).json()
df_loan=pd.DataFrame(columns=['Application_ID', 'Gender',
 'Married','Dependents','Education','Self_Employed',
 'Credit_History','Property_Area','Income','Application_Status'])

In [29]:
for i in range(len(resp)):
    tempDf=pd.DataFrame([{'Application_ID':resp[i]['Application_ID'],
                  'Gender':resp[i]['Gender'],
                  'Married':resp[i]['Married'],
                  'Dependents':resp[i]['Dependents'],
                  'Education':resp[i]['Education'],
                  'Self_Employed':resp[i]['Self_Employed'],
                  'Credit_History':resp[i]['Credit_History'],
                  'Property_Area':resp[i]['Property_Area'],
                  'Income':resp[i]['Income'],
                  'Application_Status':resp[i]['Application_Status']}])
    df_loan=pd.concat([df_loan,tempDf],ignore_index=True )

In [30]:
df_loan.head()

,Application_ID,Gender,Married,Dependents,Education,Self_Employed,Credit_History,Property_Area,Income,Application_Status
0,LP001002,Male,No,0,Graduate,No,1,Urban,medium,Y
1,LP001003,Male,Yes,1,Graduate,No,1,Rural,medium,N
2,LP001005,Male,Yes,0,Graduate,Yes,1,Urban,low,Y
3,LP001006,Male,Yes,0,Not Graduate,No,1,Urban,low,Y
4,LP001008,Male,No,0,Graduate,No,1,Urban,medium,Y

In [31]:
df_loan.shape

(511, 10)

In [32]:
df_loan.isnull().sum()

Application_ID        0
Gender                0
Married               0
Dependents            0
Education             0
Self_Employed         0
Credit_History        0
Property_Area         0
Income                0
Application_Status    0
dtype: int64

In [33]:
df_loan[df_loan.duplicated()]

Empty DataFrame
Columns: [Application_ID, Gender, Married, Dependents, Education, Self_Employed, Credit_History, Property_Area, Income, Application_Status]
Index: []

In [34]:
df_loan.to_csv('Loan_Data.csv')
df_loan.head()

,Application_ID,Gender,Married,Dependents,Education,Self_Employed,Credit_History,Property_Area,Income,Application_Status
0,LP001002,Male,No,0,Graduate,No,1,Urban,medium,Y
1,LP001003,Male,Yes,1,Graduate,No,1,Rural,medium,N
2,LP001005,Male,Yes,0,Graduate,Yes,1,Urban,low,Y
3,LP001006,Male,Yes,0,Not Graduate,No,1,Urban,low,Y
4,LP001008,Male,No,0,Graduate,No,1,Urban,medium,Y

In [42]:
schema=StructType([
    StructField('Application_ID',StringType()),
    StructField('Gender',StringType()),
    StructField('Married',StringType()),
    StructField('Dependents',StringType()),
    StructField('Education',StringType()),
    StructField('Self_Employed',StringType()),
    StructField('Credit_History',IntegerType()),
    StructField('Property_Area',StringType()),
    StructField('Income',StringType()),
    StructField('Application_Status',StringType())
])
spark_df=spark.createDataFrame(df_loan,schema=schema)
write_to_db(spark_df,'CDW_SAPP_loan_application')

CDW_SAPP_loan_application table is created